test_cases/3d/aero_1h_3d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table (
    (0.00000 (0.07982 0 0))
    (0.05000 (0.35227 0 0))
    (0.10000 (0.41571 0 0))
    (0.15000 (0.45799 0 0))
    (0.20000 (0.49057 0 0))
    (0.25000 (0.51743 0 0))
    (0.30000 (0.54046 0 0))
    (0.35000 (0.56074 0 0))
    (0.40000 (0.57891 0 0))
    (0.45000 (0.59543 0 0))
    (0.50000 (0.61061 0 0))
    (0.55000 (0.62467 0 0))
    (0.60000 (0.63779 0 0))
    (0.65000 (0.65011 0 0))
    (0.70000 (0.66172 0 0))
    (0.75000 (0.67271 0 0))
    (0.80000 (0.68317 0 0))
    (0.85000 (0.69313 0 0))
    (0.90000 (0.70266 0 0))
    (0.95000 (0.71180 0 0))
    (1.00000 (0.72057 0 0))
    (1.05000 (0.72902 0 0))
    (1.10000 (0.73717 0 0))
    (1.15000 (0.74503 0 0))
    (1.20000 (0.75265 0 0))
    (1.25000 (0.76002 0 0))
    (1.30000 (0.76718 0 0))
    (1.35000 (0.77413 0 0))
    (1.40000 (0.78088 0 0))
    (1.45000 (0.78745 0 0))
    (1.50000 (0.79386 0 0))
    (1.55000 (0.80010 0 0))
    (1.60000 (0.80619 0 0))
    (1.65000 (0.81214 0 0))
    (1.70000 (0.81795 0 0))
    (1.75000 (0.82364 0 0))
    (1.80000 (0.82920 0 0))
    (1.85000 (0.83464 0 0))
    (1.90000 (0.83998 0 0))
    (1.95000 (0.84521 0 0))
    (2.00000 (0.85033 0 0))
    (2.05000 (0.85536 0 0))
    (2.10000 (0.86030 0 0))
    (2.15000 (0.86515 0 0))
    (2.20000 (0.86992 0 0))
    (2.25000 (0.87460 0 0))
    (2.30000 (0.87920 0 0))
    (2.35000 (0.88373 0 0))
    (2.40000 (0.88819 0 0))
    (2.45000 (0.89257 0 0))
    (2.50000 (0.89689 0 0))
    (2.55000 (0.90115 0 0))
    (2.60000 (0.90534 0 0))
    (2.65000 (0.90946 0 0))
    (2.70000 (0.91353 0 0))
    (2.75000 (0.91755 0 0))
    (2.80000 (0.92151 0 0))
    (2.85000 (0.92541 0 0))
    (2.90000 (0.92926 0 0))
    (2.95000 (0.93307 0 0))
    (3.00000 (0.93682 0 0))
    (3.05000 (0.94053 0 0))
    (3.10000 (0.94419 0 0))
    (3.15000 (0.94780 0 0))
    (3.20000 (0.95137 0 0))
    (3.25000 (0.95491 0 0))
    (3.30000 (0.95839 0 0))
    (3.35000 (0.96184 0 0))
    (3.40000 (0.96525 0 0))
    (3.45000 (0.96863 0 0))
    (3.50000 (0.97196 0 0))
    (3.55000 (0.97526 0 0))
    (3.60000 (0.97852 0 0))
    (3.65000 (0.98175 0 0))
    (3.70000 (0.98495 0 0))
    (3.75000 (0.98811 0 0))
    (3.80000 (0.99124 0 0))
    (3.85000 (0.99435 0 0))
    (3.90000 (0.99741 0 0))
    (3.95000 (1.00045 0 0))
    (4.00000 (1.00347 0 0))
    (4.05000 (1.00645 0 0))
    (4.10000 (1.00940 0 0))
    (4.15000 (1.01233 0 0))
    (4.20000 (1.01523 0 0))
    (4.25000 (1.01810 0 0))
    (4.30000 (1.02095 0 0))
    (4.35000 (1.02378 0 0))
    (4.40000 (1.02658 0 0))
    (4.45000 (1.02935 0 0))
    (4.50000 (1.03210 0 0))
    (4.55000 (1.03483 0 0))
    (4.60000 (1.03753 0 0))
    (4.65000 (1.04022 0 0))
    (4.70000 (1.04288 0 0))
    (4.75000 (1.04552 0 0))
    (4.80000 (1.04814 0 0))
    (4.85000 (1.05074 0 0))
    (4.90000 (1.05331 0 0))
    (4.95000 (1.05587 0 0))
    (5.00000 (1.05841 0 0))
    (5.05000 (1.06093 0 0))
    (5.10000 (1.06343 0 0))
    (5.15000 (1.06591 0 0))
    (5.20000 (1.06837 0 0))
    (5.25000 (1.07082 0 0))
    (5.30000 (1.07324 0 0))
    (5.35000 (1.07565 0 0))
    (5.40000 (1.07805 0 0))
    (5.45000 (1.08042 0 0))
    (5.50000 (1.08278 0 0))
    (5.55000 (1.08513 0 0))
    (5.60000 (1.08745 0 0))
    (5.65000 (1.08977 0 0))
    (5.70000 (1.09206 0 0))
    (5.75000 (1.09434 0 0))
    (5.80000 (1.09661 0 0))
    (5.85000 (1.09886 0 0))
    (5.90000 (1.10110 0 0))
    (5.95000 (1.10332 0 0))
    (6.00000 (1.10553 0 0))
    (6.05000 (1.10772 0 0))
    (6.10000 (1.10990 0 0))
    (6.15000 (1.11207 0 0))
    (6.20000 (1.11422 0 0))
    (6.25000 (1.11636 0 0))
    (6.30000 (1.11849 0 0))
    (6.35000 (1.12060 0 0))
    (6.40000 (1.12270 0 0))
    (6.45000 (1.12479 0 0))
    (6.50000 (1.12687 0 0))
);
        direction       (0 0 1);
        origin          0;
    }
    outlet    { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    ground    { type noSlip; }
    buildings { type noSlip; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
